<a href="https://colab.research.google.com/github/kimham1285/2025-1-myclass-BDA/blob/main/02w_B_0312_pandas_basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

s = ['희빈', '수영', '현수', '지호', '지민']
p = pd.Series([99, 84, 92, 65, 78], index=s)
p

희빈    99
수영    84
현수    92
지호    65
지민    78
dtype: int64

In [ ]:
p.name = '수학성적'
p.index.name = '이름'
p

이름
희빈    99
수영    84
현수    92
지호    65
지민    78
Name: 수학성적, dtype: int64

In [ ]:
p.sort_values()

이름
지호    65
지민    78
수영    84
현수    92
희빈    99
Name: 수학성적, dtype: int64

In [ ]:
p.sort_values(ascending=False)

이름
희빈    99
현수    92
수영    84
지민    78
지호    65
Name: 수학성적, dtype: int64

In [ ]:
p.sort_index(ascending=False)

이름
희빈    99
현수    92
지호    65
지민    78
수영    84
Name: 수학성적, dtype: int64

In [ ]:
print(p.max())
print(p.min())
print(p.mean())
print(p.median())
print(p.count())
print(p.size)

99
65
83.6
84.0
5
5

In [ ]:
p.describe()

count     5.000000
mean     83.600000
std      13.088163
min      65.000000
25%      78.000000
50%      84.000000
75%      92.000000
max      99.000000
Name: 수학성적, dtype: float64

In [ ]:
s = pd.Series([3, 1, 1, 2, None, np.nan, 4, 6, 6, np.nan])
s

0    3.0
1    1.0
2    1.0
3    2.0
4    NaN
5    NaN
6    4.0
7    6.0
8    6.0
9    NaN
dtype: float64

In [ ]:
df = pd.DataFrame([{'국어': 70, '수학': 89, '영어': 90},
                   {'국어': 80, '영어': 99},
                   {'수학': 66, '영어': 78}])

NameError: name 'array' is not defined

In [ ]:
dates = pd.dates_range("20250302", periods=6)
dates
Datetimeindex(['2025-03-02', '2025-03-03', 2025-03-04, '2025-03-05',
               '2025-03-06', ])